In [3]:
import pandas as pd
import numpy as np

In [5]:
data = pd.Series(np.random.randint(10, size = 5))
print(data)

0    4
1    5
2    3
3    5
4    9
dtype: int64

In [6]:
data = pd.Series(np.random.randint(10, size=5), index=['A','B','C','D','E'])
print(data)

A    2
B    8
C    3
D    6
E    8
dtype: int64

In [9]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([2, 8, 3, 6, 8]))

In [11]:
data.name = "random number"

In [12]:
data*10

A    20
B    80
C    30
D    60
E    80
Name: random number, dtype: int64

In [13]:
data[["B","C","E"]]

B    8
C    3
E    8
Name: random number, dtype: int64

In [14]:
data[1:3]

B    8
C    3
Name: random number, dtype: int64

In [19]:
data[::-1]

E    8
D    6
C    3
B    8
A    2
Name: random number, dtype: int64

In [20]:
data > 3

A    False
B     True
C    False
D     True
E     True
Name: random number, dtype: bool

In [21]:
data[data > 3]

B    8
D    6
E    8
Name: random number, dtype: int64

In [22]:
for idx, val in data.items():
    print(idx, val)

A 2
B 8
C 3
D 6
E 8

In [23]:
dic = {"D":7, "E":5, "F":9}
data2 = pd.Series(dic)
data2

D    7
E    5
F    9
dtype: int64

In [25]:
result = data + data2
result

A     NaN
B     NaN
C     NaN
D    13.0
E    13.0
F     NaN
dtype: float64

In [26]:
print(result.notnull())
result = result[result.notnull()]
result

A    False
B    False
C    False
D     True
E     True
F    False
dtype: bool

D    13.0
E    13.0
dtype: float64

In [27]:
result[0]

13.0

In [28]:
df = pd.DataFrame(columns=["Email", "Name"])
df["Name"] = ["fcamp", "dss"]
df["Email"] = ["fcamp@gmail.com", "dss@gmail.com"]
df

             Email   Name
0  fcamp@gmail.com  fcamp
1    dss@gmail.com    dss

In [34]:
index = ["first", "second"]
data = {"Email": ["fcamp@gmail.com", "dss@gmail"], "Name" : ["fcamp", "dss"]}
df = pd.DataFrame(data, index=index)
df

                  Email   Name
first   fcamp@gmail.com  fcamp
second        dss@gmail    dss

In [35]:
df.index, df.columns, df.values

(Index(['first', 'second'], dtype='object'),
 Index(['Email', 'Name'], dtype='object'),
 array([['fcamp@gmail.com', 'fcamp'],
        ['dss@gmail', 'dss']], dtype=object))

In [53]:
data = {"Email": ["fcamp@gmail.com", "dss@gmail.com"], "Name": ["fcamp", "dss"]}
df = pd.DataFrame(data)
df

             Email   Name
0  fcamp@gmail.com  fcamp
1    dss@gmail.com    dss

In [54]:
df.loc[1], df["Email"]

(Email    dss@gmail.com
 Name               dss
 Name: 1, dtype: object, 0    fcamp@gmail.com
 1      dss@gmail.com
 Name: Email, dtype: object)

In [55]:
df.loc[2] = {"Email":"data@gamail", "Name":"data"}
df

             Email   Name
0  fcamp@gmail.com  fcamp
1    dss@gmail.com    dss
2      data@gamail   data

In [57]:
df.loc[len(df)] = {"Email":"science@naver.com", "Name":"science"}
df

               Email     Name
0    fcamp@gmail.com    fcamp
1      dss@gmail.com      dss
2        data@gamail     data
3  science@naver.com  science

In [58]:
df["Address"] = ""
df

               Email     Name Address
0    fcamp@gmail.com    fcamp
1      dss@gmail.com      dss
2        data@gamail     data
3  science@naver.com  science

In [61]:
df["Address"] = ["Seoul", "Cherwon", "Incheon", "Jeju"]
df

               Email     Name  Address
0    fcamp@gmail.com    fcamp    Seoul
1      dss@gmail.com      dss  Cherwon
2        data@gamail     data  Incheon
3  science@naver.com  science     Jeju

In [62]:
def name(name):
    return "{}({})".format(name, len(name))
df["New_Name"] = df["Name"].apply(name)
df

               Email     Name  Address    New_Name
0    fcamp@gmail.com    fcamp    Seoul    fcamp(5)
1      dss@gmail.com      dss  Cherwon      dss(3)
2        data@gamail     data  Incheon     data(4)
3  science@naver.com  science     Jeju  science(7)

In [66]:
df["New_Address"] = df["Address"].apply(lambda addr: "{}({})".format(addr, len(addr)))
df

               Email     Name  Address    New_Name New_Address
0    fcamp@gmail.com    fcamp    Seoul    fcamp(5)    Seoul(5)
1      dss@gmail.com      dss  Cherwon      dss(3)  Cherwon(7)
2        data@gamail     data  Incheon     data(4)  Incheon(7)
3  science@naver.com  science     Jeju  science(7)     Jeju(4)

In [85]:
import random, string
def get_name():
    names = ['정석', '민기', '석호', '한결', '용석']
    return random.choice(names)
def get_age(start=20, end=25):
    return random.randint(start, end)
def make_data(rows=5):
    datas = []
    for _ in range(rows):
        data = {"Age":get_age(), "Name":get_name()}
        datas.append(data)
    return datas

In [86]:
make_data()

[{'Age': 23, 'Name': '민기'},
 {'Age': 24, 'Name': '한결'},
 {'Age': 25, 'Name': '정석'},
 {'Age': 21, 'Name': '한결'},
 {'Age': 21, 'Name': '민기'}]

In [87]:
data1 = make_data()
df1 = pd.DataFrame(data1)
df1

   Age Name
0   20   정석
1   22   한결
2   21   민기
3   21   한결
4   23   정석

In [88]:
data2 = make_data()
df2 = pd.DataFrame(data2)
df2

   Age Name
0   24   한결
1   22   석호
2   24   석호
3   20   한결
4   21   정석

In [89]:
df3 = df1.append(df2)
df3

   Age Name
0   20   정석
1   22   한결
2   21   민기
3   21   한결
4   23   정석
0   24   한결
1   22   석호
2   24   석호
3   20   한결
4   21   정석

In [90]:
df3.reset_index(drop=True, inplace=True)
df3

   Age Name
0   20   정석
1   22   한결
2   21   민기
3   21   한결
4   23   정석
5   24   한결
6   22   석호
7   24   석호
8   20   한결
9   21   정석

In [91]:
df3 = df1.append(df2, ignore_index=True)
df3

   Age Name
0   20   정석
1   22   한결
2   21   민기
3   21   한결
4   23   정석
5   24   한결
6   22   석호
7   24   석호
8   20   한결
9   21   정석

In [101]:
df3 = pd.concat([df1, df3], axis=1, join = 'inner')
df3

   Age Name  Age Name
0   20   정석   20   정석
1   22   한결   22   한결
2   21   민기   21   민기
3   21   한결   21   한결
4   23   정석   23   정석

In [102]:
g_df = pd.DataFrame(make_data(20))
g_df.tail()

    Age Name
15   20   정석
16   21   한결
17   25   한결
18   24   용석
19   21   용석

In [103]:
g_df

    Age Name
0    20   민기
1    22   민기
2    21   한결
3    25   석호
4    25   정석
5    20   용석
6    22   정석
7    25   민기
8    20   한결
9    23   용석
10   24   정석
11   25   정석
12   24   한결
13   22   정석
14   25   한결
15   20   정석
16   21   한결
17   25   한결
18   24   용석
19   21   용석